Ruby/07_to_do_list/app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_email(params[:session][:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = ? LIMIT 1  [["email", "ola@ola"]]