Ruby/07_to_do_list/app/controllers/todos_controller.rb

SELECT `todos`.* FROM `todos` WHERE `todos`.`user_id` = 1
---
  def index
    @todos = Todo.where({:user_id=>@current_user.id})

INSERT INTO `todos` (`content`, `user_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["content", "boom"], ["user_id", 1], ["created_at", "2015-07-03 00:49:26"], ["updated_at", "2015-07-03 00:49:26"]]
---
  def create
    @todo = Todo.new(todo_params)
    @todo.user_id = @current_user.id
    @todo.save!

SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = ? LIMIT 1  [["id", 1]]
---
  def edit
    @todo = Todo.find(params[:id])

SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `todos` SET `content` = ?, `updated_at` = ? WHERE `todos`.`id` = ?  [["content", "pam pam pom"], ["updated_at", "2015-07-03 16:15:35"], ["id", 1]]
---
  def update
    @todo = Todo.find(params[:id])
    if @todo.update_attributes(todo_params)

SELECT  `todos`.* FROM `todos` WHERE `todos`.`id` = ? LIMIT 1  [["id", 3]]
DELETE FROM `todos` WHERE `todos`.`id` = ?  [["id", 3]]
---
  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy